src/main/resources/test/GetParameterValues.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-2" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header>
		<cwmp:HoldRequests SOAP-ENV:mustUnderstand="1">0</cwmp:HoldRequests>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<cwmp:GetParameterValues>
			<ParameterNames SOAP-ENC:arrayType="cwmp:string[1]">
				<string>
					Device.DeviceInfo.SoftwareVersion
				</string>
			</ParameterNames>
		</cwmp:GetParameterValues>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>